Revit 2026 API

# AdvancedLayeredSurfaceAnisotropy Property

---

The property labeled "Anisotropy" from the "AdvancedLayered" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string SurfaceAnisotropy { get; }
```
```vb
Public Shared ReadOnly Property SurfaceAnisotropy As String
	Get
```
```cpp
public:
static property String^ SurfaceAnisotropy {
	String^ get ();
}
```
```fsharp
static member SurfaceAnisotropy : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble". This property allows a connected asset.

#### Reference

AdvancedLayered Class

Autodesk.Revit.DB.Visual Namespace